andrewleech/micropython/ports/stm32/usbd_conf.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 */

/**
  ******************************************************************************
  * @file    USB_Device/CDC_Standalone/Src/usbd_conf.c
  * @author  MCD Application Team
  * @version V1.0.1
  * @date    26-February-2014
  * @brief   This file implements the USB Device library callbacks and MSP
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

#include "usbd_core.h"
#include "py/obj.h"
#include "py/mphal.h"
#include "shared/tinyusb/mp_usbd.h"
#include "irq.h"
#include "usb.h"

// Only compile USB Device configuration when device mode is enabled
// For TinyUSB, also check MICROPY_HW_ENABLE_USBDEV to support host-only mode
#if MICROPY_HW_STM_USB_STACK || (MICROPY_HW_TINYUSB_STACK && MICROPY_HW_ENABLE_USBDEV)

#if BUILDING_MBOOT
// TinyUSB not used in mboot
#undef MICROPY_HW_TINYUSB_STACK
#endif

// These handles are also used in Interrupt / Wakeup handlers.
#if MICROPY_HW_USB_FS
PCD_HandleTypeDef pcd_fs_handle;
#endif
#if MICROPY_HW_USB_HS
PCD_HandleTypeDef pcd_hs_handle;
#endif

#if defined(STM32G0) || defined(STM32H5)
#define USB_OTG_FS USB_DRD_FS
#elif !MICROPY_HW_USB_IS_MULTI_OTG
// The MCU has a single USB device-only instance
#define USB_OTG_FS USB
#endif

#if defined(STM32N6)
#define USB_OTG_HS USB1_OTG_HS
#define OTG_HS_IRQn USB1_OTG_HS_IRQn
#endif

#if MICROPY_HW_USB_FS
void mp_usbd_ll_init_fs(void) {
    {
        // Configure USB GPIO's.

        #if defined(STM32G0) || defined(STM32G4)

        // These MCUs don't have an alternate function for USB but rather require
        // the pins to be disconnected from all peripherals, ie put in analog mode.

        mp_hal_pin_config(pin_A11, MP_HAL_PIN_MODE_ANALOG, MP_HAL_PIN_PULL_NONE, 0);
        mp_hal_pin_config_speed(pin_A11, GPIO_SPEED_FREQ_VERY_HIGH);
        mp_hal_pin_config(pin_A12, MP_HAL_PIN_MODE_ANALOG, MP_HAL_PIN_PULL_NONE, 0);
        mp_hal_pin_config_speed(pin_A12, GPIO_SPEED_FREQ_VERY_HIGH);

        #elif defined(STM32L1)

        // STM32L1 doesn't have an alternate function for USB.
        // To be disconnected from all peripherals, put in input mode.

        mp_hal_pin_config(pin_A11, MP_HAL_PIN_MODE_INPUT, MP_HAL_PIN_PULL_NONE, 0);
        mp_hal_pin_config_speed(pin_A11, GPIO_SPEED_FREQ_VERY_HIGH);
        mp_hal_pin_config(pin_A12, MP_HAL_PIN_MODE_INPUT, MP_HAL_PIN_PULL_NONE, 0);
        mp_hal_pin_config_speed(pin_A12, GPIO_SPEED_FREQ_VERY_HIGH);

        #else

        // Other MCUs have an alternate function for GPIO's to be in USB mode.

        #if defined(STM32H7)
        const uint32_t otg_alt = GPIO_AF10_OTG1_FS;
        #elif defined(STM32L0)
        const uint32_t otg_alt = GPIO_AF0_USB;
        #elif defined(STM32L432xx) || defined(STM32L452xx)
        const uint32_t otg_alt = GPIO_AF10_USB_FS;
        #elif defined(STM32H5) || defined(STM32U5) || defined(STM32WB)
        const uint32_t otg_alt = GPIO_AF10_USB;
        #else
        const uint32_t otg_alt = GPIO_AF10_OTG_FS;
        #endif

        mp_hal_pin_config(pin_A11, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_NONE, otg_alt);
        mp_hal_pin_config_speed(pin_A11, GPIO_SPEED_FREQ_VERY_HIGH);
        mp_hal_pin_config(pin_A12, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_NONE, otg_alt);
        mp_hal_pin_config_speed(pin_A12, GPIO_SPEED_FREQ_VERY_HIGH);

        #endif

        #if defined(MICROPY_HW_USB_VBUS_DETECT_PIN)
        // USB VBUS detect pin is always A9
        mp_hal_pin_config(MICROPY_HW_USB_VBUS_DETECT_PIN, MP_HAL_PIN_MODE_INPUT, MP_HAL_PIN_PULL_NONE, 0);
        #endif

        #if defined(MICROPY_HW_USB_OTG_ID_PIN)
        // USB ID pin is always A10
        // Always use pull-up to match TinyUSB BSP - OTG controller overrides pull direction for host mode
        mp_hal_pin_config(MICROPY_HW_USB_OTG_ID_PIN, MP_HAL_PIN_MODE_ALT_OPEN_DRAIN, MP_HAL_PIN_PULL_UP, otg_alt);
        #endif

        // Keep USB clock running during sleep or else __WFI() will disable the USB
        #if defined(STM32G0) || defined(STM32H5)
        __HAL_RCC_USB_CLK_SLEEP_ENABLE();
        #elif defined(STM32H7)
        __HAL_RCC_USB2_OTG_FS_CLK_SLEEP_ENABLE();
        __HAL_RCC_USB2_OTG_FS_ULPI_CLK_SLEEP_DISABLE();
        #endif

        // Enable USB FS Clocks
        #if !MICROPY_HW_USB_IS_MULTI_OTG
        __HAL_RCC_USB_CLK_ENABLE();
        #else
        __USB_OTG_FS_CLK_ENABLE();
        #endif

        // Enable VDDUSB
        #if defined(STM32H5) || defined(STM32WB)
        HAL_PWREx_EnableVddUSB();
        #elif defined(STM32L4) || defined(STM32U5)
        if (__HAL_RCC_PWR_IS_CLK_DISABLED()) {
            __HAL_RCC_PWR_CLK_ENABLE();
            HAL_PWREx_EnableVddUSB();
            __HAL_RCC_PWR_CLK_DISABLE();
        } else {
            HAL_PWREx_EnableVddUSB();
        }
        #endif

        // Configure and enable USB FS interrupt
        #if defined(STM32G0)
        NVIC_SetPriority(USB_UCPD1_2_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_UCPD1_2_IRQn);
        #elif defined(STM32H5)
        NVIC_SetPriority(USB_DRD_FS_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_DRD_FS_IRQn);
        #elif defined(STM32L0)
        NVIC_SetPriority(USB_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_IRQn);
        #elif defined(STM32L432xx) || defined(STM32L452xx)
        NVIC_SetPriority(USB_FS_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_FS_IRQn);
        #elif defined(STM32G4) || defined(STM32L1) || defined(STM32WB)
        NVIC_SetPriority(USB_LP_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_LP_IRQn);
        #else
        NVIC_SetPriority(OTG_FS_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(OTG_FS_IRQn);
        #endif

        #if MICROPY_HW_TINYUSB_STACK
        // Configure VBUS sensing for TinyUSB on STM32F4/F7 which have separate GCCFG register
        // The DWC2 PHY init only sets PWRDWN bit, but doesn't configure VBUS sensing
        #if defined(STM32F4) || defined(STM32F7)
        #if defined(MICROPY_HW_USB_VBUS_DETECT_PIN)
        // Enable VBUS sensing in "B device" mode (using PA9)
        USB_OTG_FS->GCCFG &= ~USB_OTG_GCCFG_NOVBUSSENS;
        USB_OTG_FS->GCCFG |= USB_OTG_GCCFG_VBUSBSEN;
        #else
        // Force VBUS valid (no VBUS detect pin configured)
        USB_OTG_FS->GCCFG |= USB_OTG_GCCFG_NOVBUSSENS;
        USB_OTG_FS->GCCFG &= ~(USB_OTG_GCCFG_VBUSBSEN | USB_OTG_GCCFG_VBUSASEN);
        #endif
        #endif
        #endif
    }
}

#if MICROPY_HW_USB_HOST
// Configure host-mode-specific hardware (VBUS power switch)
// This should be called when switching from device to host mode
void mp_usbh_ll_init_vbus_fs(void) {
    #ifdef MICROPY_HW_USB_VBUS_POWER_PIN
    // Enable VBUS power output (PG6 on NUCLEO-F429ZI)
    // Configure as push-pull output to match TinyUSB BSP
    const machine_pin_obj_t *vbus_pin = MICROPY_HW_USB_VBUS_POWER_PIN;
    GPIO_InitTypeDef gpio_vbus = {
        .Pin = 1 << vbus_pin->pin,
            .Mode = GPIO_MODE_OUTPUT_PP,
            .Pull = GPIO_PULLDOWN,
            .Speed = GPIO_SPEED_HIGH,
    };
    HAL_GPIO_Init(vbus_pin->gpio, &gpio_vbus);
    HAL_GPIO_WritePin(vbus_pin->gpio, gpio_vbus.Pin, GPIO_PIN_SET);
    #endif
}
#endif

